[
    { 
        "id": 8,
        "aspectRatio": "4:3",
        "title": "Volkswagen HMI",
        "year": 2024,
        "preview": "VW/preview_05.webp",
        "thumb": "../VW/preview_05.webp",
        "context": "Summer internship at Volkswagen HQ in Wolfsburg, Germany",
        "team": "Stepan Vedunov",
        "role": "3D Modelling & Animation\nUX/UI Design\nInformation Architecture",
        "overview": "During my internship at Volkswagen, I was actively involved in prototyping driver display concepts for e-vehicles, focusing on user journey design, 3D modeling, motion design, and information architecture. HMI design system documentation involved creating detailed concept maps that outlined design guidelines, interaction rules, and system deltas. Additionally, I supported the consolidation of Android-based HMI systems across brands like Porsche, Audi, Seat/Cupra, and Skoda by defining and aligning interaction patterns. Image from: https://www.volkswagen-newsroom.com/"
        },
        { 
            "id": 2,
            "aspectRatio": "16:9",
            "title": "Neuranect",
            "year": 2023,
            "preview": "Neuranect/thumb_new.webp",
            "thumb": "../Neuranect/thumb_new.webp",
            "context": "Stanford University Center on\nLongevity Design Challenge",
            "team": "Sebastian Truijens (ETHz)\nElia Salerno (ZHdK)\nEge Seçgin (ZHdK) \n Stepan Vedunov (ZHdK)",
            "role": "Industrial Design\nUX/UI Design",
            "overview": "Neuranect emerged from the Stanford University Center on Longevity Design Challenge with a focus on aiding individuals experiencing early signs of dementia through purposeful, collaborative games. The solution aims to delay degenerative brain processes while promoting social interaction and physical well-being. By blending technology and gaming, Neuranect offers an accessible approach to supporting cognitive health in the elderly, enhancing their quality of life.",
            "video": "true",
            "videoNeuranect": "_",
            "process": "We began our process with an in-depth research on neuroplasticity, various stages of dementia and the  impact of serious games within this field.  Conducting competitor analysis brought us even further in understanding the needs of various stakeholders and in identifying existing pain points in current solutions. By collaborating with neurologists, serious game developers and healthcare professionals, we were able to get invaluable insight, formulate our key hypotheses and set subsequent project goals.", 
            "imgGridOne": "../Neuranect/competitor.webp",
            "imgGridTwo": "../Neuranect/dividat_1.webp",
            "imgGridThree": "../Neuranect/dividat_2.webp",
            "imgGridFour": "../Neuranect/concept.svg",
            "processTwo": "As we transitioned into the development phase, our focus shifted towards the actual design of Neuranect. Our primary objectives revolved around ensuring seamless setup and user-friendliness, all while maintaining affordability. Key to our efforts was the creation of an intuitive UI and engaging game concepts designed to address cognitive decline. However, the task of finding the right balance between simplicity and efficacy proved to be more difficult than we thought.",
            "imgGridFive": "../Neuranect/sketches.webp",
            "imgGridSix": "../Neuranect/blender_02.webp",
            "imgGridSeven": "../Neuranect/fusion.webp",
            "imgGridEight": "../Neuranect/user_flow.webp",
            "solution": "Following three intense weeks, we successfully created a solution that aligns with the goals outlined earlier. We dedicated significant effort to ensure that Neuranect is user-friendly while offering comprehensive service from A to Z. Its compact and portable design enables installation in healthcare facilities and private households alike. On top of that,  the game concepts we developed can be played alone or cooperatively, which connects people and transforms exercising into a shared experience.",
            "imgFinalOne": "../Neuranect/rendering.webp",
            "imgFinalTwo": "../Neuranect/menu.webp",
            "imgFinalThree": "../Neuranect/game_01.webp",
            "imgFinalFour": "../Neuranect/game_02.webp",
            "imgFinalFive": "../Neuranect/feedback.webp",
            "learnings": "Engaging with such a complex topic left us fulfilled with the project's outcomes. Through collaboration with experts from diverse fields and thorough research into dementia, we gained insights into challenges previously unexplored, making the task of developing an effective solution notably demanding. Given additional time, our focus would shift towards advancing Neuranect into a functional prototype and conducting comprehensive user testing."
            },
        { 
            "id": 1,
            "aspectRatio": "3:4",
            "title": "ZVV",
            "year": 2023,
            "preview": "ZVV/thumb.webp",
            "thumb": "../ZVV/thumb.webp",
            "context": "University module",
            "team": "Jeanne Antonin\nEge Seçgin\nElia Salerno\n Stepan Vedunov",
            "role": "Service Design\nUX/UI Design",
            "overview": "In the context of a university module we redesigned the user interface for ZVV ticket machines in Zurich.  Our focus has been on improving user experience and functionality through in-depth research and iterative design processes.  Employing collaborative design sprints, we improved on solutions resulting in an interface concept featuring enhanced customization, easy-to-navigate workflows, and more accessible UI features.\n It is noteworthy that this project is purely conceptual and holds no affiliation with ZVV.",
            "video": "true",
            "videoZVV": "_",
            "process": "During the discovery phase, we focussed on conducting extensive research to understand how transportation ticket machines are designed and used across different countries. This process offered valuable insights into best practises and cases to avoid. By conducting a heuristic evaluation, we pinpointed critical issues in the current user experience of ZVV ticket machines, providing a framework for our subsequent iterations. Finally, we conducted observational studies and interviews to understand the challenges faced by everyday users, which further informed our design process.",
            "imgGridOne": "../ZVV/competitors.webp",
            "imgGridFour": "../ZVV/heuristics.webp",
            "imgGridExtra": "../ZVV/interviews.webp",
            "processTwo": "In the design and iteration phase, we analysed our research findings to develop personas that encapsulated critical behavior patterns observed during our investigations. Employing a design sprint approach, we improved our proposed solutions, ensuring a co-creative design process. Furthermore, through prototyping and usability testing, we iteratively refined our designs, focusing on improving the user experience while addressing technical limitations. Additionally, we placed significant emphasis on UX writing, ensuring clarity and simplicity in our interface language to facilitate user understanding.",
            "imgGridFive": "../ZVV/design_sprints.webp",
            "imgGridSix": "../ZVV/wireframes_01.webp",
            "imgGridSeven": "../ZVV/wireframes_02.webp",
            "imgGridEight": "../ZVV/user_testing.webp",
            "solution": "Our final design improves the user experience of ZVV ticket machines significantly. By integrating insights from our research and iterative process, we created an interface that focusses on user needs. Enhanced customization options and streamlined workflows ensure an efficient ticket purchasing experience. Clear and simple language further enhances usability, and the prioritization of accessibility through visual contrast and simple layouts makes our version even more user-friendly.",
            "imgFinalOne": "../ZVV/final_01.webp",
            "imgFinalTwo": "../ZVV/final_02.webp",
            "imgFinalThree": "../ZVV/final_03.webp",
            "imgFinalFour": "../ZVV/final_04.webp",
            "imgFinalFive": "../ZVV/final_05.webp",
            "learnings": "In summary, the module allowed us to thoroughly research global ticket machine designs, experiment with wireframes, and address critical issues such as complexity and poor UX writing. Despite challenges, particularly with zone-related difficulties, our dedication led to the development of a user-friendly ticket-buying process, resulting in a fulfilling and engaging solution."
            
            },
            { 
                "id": 5,
                "aspectRatio": "4:3",
                "title": "Arcaba",
                "year": 2024,
                "preview": "Arcaba/thumb.webp",
                "thumb": "../Arcaba/thumb.webp",
                "context": "Architektur Abächerli GmbH",
                "team": "Stepan Vedunov",
                "role": "Web Design & Development",
                "overview": "The task was to design and develop a portfolio website for an architecture firm based in Zurich.  The solution is a result of several design iterations providing an adaptive viewing experience across multiple devices. ",
                "processTwo": "After initial discussions with the client and rapid sketching of ideas, we proceeded to create first low-fi wireframes. The goal was to understand the clients wants and needs and to find a common direction that would  lead us along the rest of the project. We settled on large and bold images as our main theme throughout the website design.",
                "imgGridFive": "../Arcaba/sketches.webp",
                "imgGridEight": "../Arcaba/lowfi.webp",
                "solution": "The final product is optimised for mobile as well as desktop devices and provides exposure to potential clients and investors. The first website for Arcaba is a mix of professional, modern aesthetics and functional design, placing the owners values of sustainable and playful architecture at its core.", 
                "imgFinalOne": "../Arcaba/rendering_01.webp",
                "imgFinalTwo": "../Arcaba/rendering_02.webp",
                "imgFinalFive": "../Arcaba/rendering_03.webp"
               
                },
        { 
            "id": 3,
            "aspectRatio": "1:1",
            "title": "DataVis",
            "year": 2023,
            "preview": "DataVis/preview.png",
            "thumb": "../DataVis/thumb.webp",
            "context": "University module in collaboration with ETH Crowther Lab & Focus Terra",
            "team": "Anja Fritschi\n Tara Jenkins\nCyril Keller\nStepan Vedunov",
            "role": "UX/UI Design",
            "overview": "To address the carbon storage potential beneath and above  Earth, we collaborated with ETH Crowther Lab and Focus Terra to develop an interactive table. It allows exhibition visitors to learn about nature-based solutions for CO₂ storage and understand complex global climate data. The aim is to inform and inspire  younger individuals on the topic of climate change.",
            "video": "true",
            "videoDataVis": "_",
            "process": "The first step of the process included familiarizing ourselves with the data provided by the research lab. In order to design an effective solution we first needed to understand the various datasets and get to know the goal and motivation for the upcoming science exhibition. The transition to the actual design phase started with rapid sketching where we put great emphasis on quick ideas and iterations. Clustering and combining similar ideas later served as a foundation for our entire design process.",
            "imgGridOne": "../DataVis/sketches.webp",
            "imgGridFour": "../DataVis/connections.webp",
            "processTwo": "To get valuable feedback from the users and the researchers involved in this project, we proceeded to create low-fidelity wireframes and set out to test them as quickly as possible. On top of that, we developed physical paper prototypes thanks to which we could quickly change and adapt to the criticism and discuss more nuanced aspects.  After gathering valuable feedback we went on to improve our user flow and the visuals, resulting in a orthographic view where 3D bubbles represent individual ecosystems and can thus display volumetric carbon data more accurately.",
            "imgGridFive": "../DataVis/lowfi_flow.svg",
            "imgGridSix": "../DataVis/physical.webp",
            "imgGridSeven": "../DataVis/iterations.webp",
            "imgGridEight": "../DataVis/visuals.svg",
            "solution": "The result emerged as a product of several iterations where we not only improved UX writing, visual hierarchy and accessibility features but also questioned our underlying concept, the user flow and the feeling we wanted to invoke in users after experiencing our prototype.  Consistent user testing throughout the whole process helped us in understanding where we stand and what we should improve on. It is to be noted that this project stayed on a conceptual level and was solely developed as a clickable prototype.",
            "imgFinalOne": "../DataVis/final_01.webp",
            "imgFinalTwo": "../DataVis/final_02.webp",
            "imgFinalFive": "../DataVis/final_03.webp",
            "imgFinalSix": "../DataVis/final_04.webp",
            "imgFinalSeven": "../DataVis/final_05.webp",
            "learnings": "We benefited from a strong team dynamic and overall motivation throughout the whole module.  A key takeaway was effectively handling complex data and conveying core ideas intuitively. Additionally, we recognized the importance of individual perspectives, understanding that clarity for one may not translate universally. In hindsight, we acknowledge the need for more time allocation towards coding the prototype to fully demonstrate the envisioned flow."
           
            },
            { 
                "id": 4,
                "aspectRatio": "4:3",
                "title": "TsunComp",
                "year": 2023,
                "preview": "TsunComp/preview.png",
                "thumb": "../TsunComp/thumb.webp",
                "context": "University module",
                "team": "Andreas Kohler\nElia Salerno\nDavid Polke\nStepan Vedunov",
                "role": "Industrial Design\nGUI",
                "overview": "Drawing robots are not uncommon these days, but TsunComp offers a unique feature: the ability to create custom drawings based on direct requests. Our developed pipeline is a fully automated speech to machine code process, that uses GPT3.5 and StableDiffusion at its core. It sends out the data to a customly designed plotter that then draws the generated image for you using a pen, which results in a physical memory that you can hold on to.",
                "video": "true",
                "videoTsunComp": "_",
                "process": "Our primary motivation for the project emerged from the desire to explore novel methods of interacting with LLMs. Consequently, we prioritized research into user input and interaction, defining the project's central objective as replicating AI sentience through natural, human-like interaction. In order to get an overview of the scope and divide the tasks reasonably equal, we developed a pipeline visualization that guided us throughout the whole process.",
                "imgGridOne": "../TsunComp/user_input.svg",
                "imgGridFour": "../TsunComp/pipeline.svg",
                "processTwo": "To create a robot that users would find inviting for interaction, we dedicated significant effort to the physical design of TsunComp. Our goal was to achieve a balance between a recognizable robotic appearance and a human-like feel. Therefore, our design approach centered on incorporating rounded shapes and familiar materials. With said goal in mind, we developed a straightforward GUI that accepts speech input, resembling voice messages in social media apps.",
                "imgGridFive": "../TsunComp/sketches.webp",
                "imgGridSix": "../TsunComp/cad_01.webp",
                "imgGridSeven": "../TsunComp/cad_02.webp",
                "imgGridEight": "../TsunComp/assembly.webp",
                "imgGridNine": "../TsunComp/material.webp",
                "imgGridTen": "../TsunComp/gui.webp",
                "solution": "Our final product serves as a proof of concept for pseudo-sentience in AI. We achieve this by implementing human-like features into the design, the interaction and the behavior of a robot.  This integration helps us understand the field of HRI to a deeper degree and offers a foundation for creating more compelling experiences in the future.",
                "imgFinalOne": "../TsunComp/render_01.webp",
                "imgFinalTwo": "../TsunComp/render_02.webp",
                "imgFinalFive": "../TsunComp/render_03.webp",
                "imgFinalSix": "../TsunComp/render_04.webp",
                "imgFinalSeven": "../TsunComp/render_05.webp",
                "learnings": "Throughout the module, our team stayed eager and motivated to do our best. We were satisfied with our exploration of AI, from conceptual theory to applying it in robotics. All in all, our main obstacle was inefficient time management towards the end of the two weeks. We struggled particularly with the final stages of the software pipeline development and its integration into the physical robot." 
                }, 

    { 
        "id": 6,
        "aspectRatio": "3:4",
        "title": "Swiss Diversity",
        "year": 2023,
        "preview": "SwissDiversity/preview.png",
        "thumb": "../SwissDiversity/thumb.webp",
        "context": "Swiss Diversity Association",
        "team": "Stepan Vedunov",
        "role": "Web Design & Development",
        "overview": "I was tasked with enhancing and maintaining the website for the Swiss Diversity Association. This included working on aesthetic and functional improvements and regularly updating content as well as optimising for mobile. The website serves as a dynamic platform to promote the association's mission of fostering diversity and inclusion in Switzerland.",
        "imgFinalOne": "../SwissDiversity/beforeAfter_01.webp",
        "imgFinalTwo": "../SwissDiversity/beforeAfter_02.webp",
        "imgFinalFive": "../SwissDiversity/rendering_01.webp"
    },





{ 
"id": 7,
"aspectRatio": "1:1",
"title": "Rep:Lab",
"year": 2023,
"preview": "RepLab/thumb.webp",
"thumb": "../RepLab/thumb.webp",
"context": "University module",
"team": "David Polke\nBasil Egger\n Ege Seçgin \nLuca Busby\nStepan Vedunov",
"role": "Service Design",
"overview": "Rep:Lab is  a web service that helps teachers to integrate repairing workshops into the primary and secondary school curriculum in Switzerland.  The aim is to tackle high rates of consumption, a societal issue that is yet unsolved. We believe that integrating the habit of repairing from a young age may have a substantial impact on how consumerism will evolve in the upcoming future.",
"process": "Our discover phase began with learning about planned obsolescence, black boxes and current solutions to the relatively low rates of repair that can be observed within Swiss society. Our research approach also consisted of getting to know the motivation and culture behind repairing, so we went out into the streets and asked strangers on their habits and why or which items they tend to repair at home. Most of our research lead to the conclusion that it is often faster and easier to buy a new product which resulted in the thesis that the notion of repairing should be taught from a young age in order to turn it into a habitual practice.",
"imgGridOne": "../RepLab/concept.svg",
"processTwo": "In order to test our idea in practice, we visited a primary school class in the outskirts of Zurich and conducted four different workshops throughout a whole afternoon. The workshops included repairing holes in textile, electric circuits, broken table tennis rackets and skateboard griptapes. Students could join a workshop of their choice and learn how to repair these items. We received positive feedback from the whole class at the end of the workshop, the main point being that they learned to repair seemingly difficult objects in a short amount of time. It was also a great learning experience for us as we understood what the interests and needs of our target group is.",
"imgGridFive": "../RepLab/board.webp",
"imgGridSix": "../RepLab/textile.webp",
"imgGridSeven": "../RepLab/skateboard.webp",
"imgGridEight": "../RepLab/electronics.webp",
"solution": "After the great amount of knowledge gained from our workshop we created a final prototype in form of a web application. It addresses primary school teachers and encompasses a holistic education guideline with theory material and various practical workshop descriptions sorted by category. Each module is accompanied with the necessary key information such as the duration of the workshop, preferred age,  average budget and overall learning goal. In some cases we included a video tutorial to make the process of repairing even more transparent.",
"imgFinalOne": "../RepLab/render_01.webp",
"imgFinalTwo": "../RepLab/render_02.webp",
"learnings": "For us it was a unique experience to go out into the field and work together with potential users to develop a deep understanding for the problem at hand. We are proud of the solution and see potential in developing it further into an actual product that can have significant social impact not only in the context of a primary school curriculum but also as a more holistic, societal solution."
}
]